events/API Call Events/issue.getInfo/APIRequest - issue.getInfo.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/search</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:s2="http://www.alert-project.eu/APIcall-request" xmlns:s3="http://www.alert-project.eu/APIcall-response" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>Search</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10010</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>ALERT.Search.APICallRequest</ns1:eventName>
								<ns1:eventId>9856</ns1:eventId>
								<ns1:eventType>request</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<ns1:apiRequest>
									<!-- name of method -->
									<s2:apiCall>issue.getInfo</s2:apiCall>
									<s2:requestData>
										<!-- input parameters -->
										<s2:inputParameter>
											<!-- name of parameter -->
											<s2:name>issueID</s2:name>
											<!-- value of parameter -->
											<s2:value>184671</s2:value>
										</s2:inputParameter>
									</s2:requestData>
								</ns1:apiRequest>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>